"" + 1 + 0; // строка "10", т.к. "" + преобразует все в строку
"" - 1 + 0 // число -1, т.к. "" будет 0
true + false // число 1, т.к. true 1, false 0
6 / "3" // число 2, т.к. "3" преобразует в число
"2" * "3" // число 6, т.к. строки преобразует в числа
4 + 5 + "px" // строка 9px
"$" + 4 + 5 // строка $45, конкатенация
"4" - 2 //число 2, т.к. "4" преобразует в число
"4px" - 2 // NaN
7 / 0 //infinfty
" -9 " + 5 // строка -9 5, конкатенация
" -9 " - 5 // число -14
null + 1 // 1
undefined + 1 // NaN
